{"id":"75bf5f5b-a667-4f5d-8cd9-09cc83635aa7","type":"Full Time","url":"https://jobs.github.com/positions/75bf5f5b-a667-4f5d-8cd9-09cc83635aa7","created_at":"Thu Jan 02 16:51:06 UTC 2020","company":"Impossible Foods","company_url":"http:","location":"Redwood City","title":"Software Engineer","description":"\u003cp\u003eDo you want to be part of an exciting company dedicated to solving the greatest challenge humanity faces? Then Impossible Foods is the place for you.\u003c/p\u003e\n\u003cp\u003eImpossible Foods was founded in 2011 to create a truly sustainable global food system by inventing an efficient, sustainable way to transform plants into irresistibly delicious, nutritious food -- food that delivers all the pleasures and nutritional benefits consumers demand, without the destructive environmental impact. Our first product, the Impossible Burger, was introduced by top chefs to the world and is currently available at over 16,000+ restaurants across the United States and abroad.\u003c/p\u003e\n\u003cp\u003eThe research and development team is composed of world class scientists who are dedicated to solving one of the most important threats to global ecological stability. We are developing the most advanced food technology platform in the world because our challenging goals and short timeline demand it. Software and data science play a key role in facilitating data management, visualization, and analysis for R\u0026amp;D. We have embraced web technologies, cloud, and agile development. We are a small team, we build maintainable apps that fulfill a variety of needs for the R\u0026amp;D team, and we assist and educate in order to empower the broader team as well.\u003c/p\u003e\n\u003cp\u003eTo those ends we are looking for a full stack web developer to help us design, build, and deploy modern web applications. You will make core design decisions and influence how software gets done organization-wide. You will have an open mind and entrepreneurial spirit to get projects done in the most expedient manner, whether that means coding it up ourselves or outsourcing, and you will continually find new opportunities to make an impact within the company.\u003c/p\u003e\n\u003cp\u003eYou Will:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eDesign and maintain web-based applications and databases to support scientific exploration and product development\u003c/li\u003e\n\u003cli\u003eTranslate research team needs into good software design\u003c/li\u003e\n\u003cli\u003eWork across the entire software development lifecycle, from determining the needs of Impossible Foods scientists, all the way through maintenance and bug fixing\u003c/li\u003e\n\u003cli\u003eManage hosting applications on cloud services\u003c/li\u003e\n\u003cli\u003eSubmit PRs against existing feature requests and bugs\u003c/li\u003e\n\u003cli\u003eContribute code, design ideas, and architecture solutions as part of a small Agile development team\u003c/li\u003e\n\u003cli\u003eCollaborate with scientists, business managers, and other developers to achieve goals\u003c/li\u003e\n\u003cli\u003eEnhance and support a culture of innovation, responsibility, hard work, and fun\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eYou Have:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eB.S. in Computer Science or related experience\u003c/li\u003e\n\u003cli\u003e3+ years software development experience\u003c/li\u003e\n\u003cli\u003eStrong Python and JavaScript skills\u003c/li\u003e\n\u003cli\u003eExperience with web frameworks\u003c/li\u003e\n\u003cli\u003eStrong communication skills, preferably with experience in dealing directly with users and/or stakeholders\u003c/li\u003e\n\u003cli\u003eSelf-motivated, with good organizational and time management skills\u003c/li\u003e\n\u003cli\u003eEntrepreneurial spirit to get projects done in expedient ways and to continually find new opportunities to make an impact\u003c/li\u003e\n\u003cli\u003eAbility to work with a diverse, dynamic team effectively\u003c/li\u003e\n\u003cli\u003eAbility to continuously challenge assumptions, create new ideas, and push boundaries without pushing other people’s buttons\u003c/li\u003e\n\u003cli\u003eExperience programming for scientific applications (bioinformatics, cheminformatics, experimental data management) a big plus\u003c/li\u003e\n\u003cli\u003eBackground in statistical inference a big plus\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003eApply Here:\u003c/p\u003e\n\u003cp\u003ePlease apply by going to our website: \u003ca href=\"https://impossiblefoods.com/careers/\"\u003ehttps://impossiblefoods.com/careers/\u003c/a\u003e\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBa0I3IiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--ec17cc2a2703ba2bb660de98e8bb28d7985a4abb/WAH-plant.jpg-large"}
